04_OpenFoam/_ref/OpenFOAM-14/compressibleVoF/depthCharge3D/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField
{
    type        surfaces;

    defaultValue 300;

    surfaces
    {
        bubble
        {
            type        sphere;

            centre      (0.5 0.5 0.5);
            radius      0.1;

            value       578;
        }
    }
}

boundaryField
{
    walls
    {
        type            zeroGradient;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
